{"resume_text": "Led team of seven engineers in executing critical third-party integrations, including Google Ad tags, Salesforce, and CRM integrations, to improve system performance and user experience. Collaborated with cross-functional teams to build self-service platform for sponsorship team, allowing them to create and manage sweepstakes landing pages independently. Select Achievements Enhanced lead conversion rates 20% and improved customer retention 15% by designing and implementing custom data migration solutions with marketing team, resulting in more streamlined customer journey. Contributed to $10M in savings and increased operational efficiency 25% by overseeing high-impact migration project, transferring user data to new vendor and seamlessly integrating it into proprietary apps. Increased site traffic 40% and boosted user engagement within first quarter by orchestrating development and successful launch of Cooks Country website, utilizing PHP and .NET backend APIs. Reduced system downtime 30% and decreased dependency on development team 50% by implementing continuous improvements in infrastructure and processes. America’s Test Kitchen | Boston, MA 01/2010-01/2011 Developer II Collaborated with cross-functional teams, including design and business partners, to create user-friendly, efficient platform; ensured full buy-in and approval from all stakeholders throughout project lifecycle. Select Achievements Drove complete redesign and development of Cooks Illustrated platform, rewriting entire site from legacy .NET ASP to PHP; utilized Waterfall approach to ensure seamless transition and alignment with business goals. Spearheaded migration of legacy ASP websites to PHP, executing comprehensive solution that included data transfer and migration to AWS EC2 servers that optimized system performance, scalability, and cost-efficiency. Reed Business Information | Waltham, WA 01/2007-04/2010 Web Developer Led coding efforts as sole East Coast team member, collaborating with West Coast-based team to develop new module components for large-scale PHP website serving 200+ trade magazines. TECHNICAL • Vestmark • Plus • Advisor • Designers • Financial • Similar • Status • Years • Authorization • Azure Ruby on Rails, SQL, Postgres, Redis, Heroku, Sidekiq, MongoDB, JavaScript, jQuery, React, Next.js, HTML, CMS, Python, .NET, PHP, ASP, Google Ads, Salesforce, AI (Gemini, DeepSeek,OpenAI,Llama), Large Language Models (LLMs), AWS EDUCATION University of Miami | Coral Gables, FL Bachelor of Science, Communications & Public Relations Bunker Hill Community College | Boston, MA Marine Technician Program\n", "job_description": "About the job\r\nVestmark is seeking a Full Stack Engineer with expertise in Ruby on Rails and React to help us build and enhance our financial advisor portal. In this role, you will work closely with product managers, designers, and other engineers to develop robust, scalable, and high-performance applications. This role operates in a hybrid work model based out of One Kendall Square, Cambridge MA or Wakefield, MA.\r\n\r\nResponsibilities\r\n\r\nDevelop, maintain, and improve Vestmark’s financial advisor platform using Ruby on Rails on the backend and React on the frontend.\r\nBuild RESTful APIs to support web and mobile applications.\r\nImplement well-structured, reusable, and testable code following best practices.\r\nCollaborate with UX/UI designers to deliver a seamless and intuitive user experience.\r\nOptimize application performance and scalability.\r\nWrite unit and integration tests to ensure high code quality.\r\nParticipate in code reviews, pair programming, and team discussions.\r\nWork with DevOps to deploy and monitor applications in production.\r\n\r\nQualifications\r\n\r\n3+ years of experience with Ruby on Rails development.\r\n2+ years of experience with React and modern JavaScript (ES6+).\r\nExperience with PostgreSQL or other relational databases.\r\nProficiency in writing scalable, secure, and maintainable code.\r\nExperience with TypeScript and Inertia.js is a plus.\r\nStrong grasp of object-oriented and functional programming concepts.\r\nExperience with testing frameworks like RSpec, Jest, or similar.\r\nFamiliarity with containerization (Docker) and cloud environments (AWS, Azure, or GCP) is a plus.\r\nExperience with authentication and authorization systems (Okta, Devise, or similar) is a plus.\r\n\r\nVestmark is an equal opportunity employer. We celebrate diversity and are committed to creating an inclusive environment for all employees. Vestmark prohibits employment discrimination on the basis of race, color, religion, gender identity, sex, sexual orientation, pregnancy, national origin, age, disability status, protected military or veteran status, and genetic information.", "original_filename": "Untitled_document.docx"}