{"resume_text": "   Christopher Candelora\nRevere, MA 02151 • (781) 413-7594 \n • \n\nWeb Developer\nResults-driven software engineer who champions high-quality web content creation across back- and front-end systems. Collaborative leader who prioritizes mentorship and continuous improvement to foster high-performing teams and deliver robust, scalable solutions. Experience in diverse technologies and methodologies, with a deep understanding of modern programming.\n\nCORE COMPETENCIES\nWeb Content Design • Software Development • Web Services & Analytics • DNS Management • Content Creation\nTest Scripts • A/B Testing • Agile/Waterfall Methodologies • Project Management • User Requirements • Digital Marketing\nSystem Implementation • Leadership & Collaboration • Social Media Integration • Continuous Improvement • Editing\n\nEXPERIENCE\nFreelance| Revere, MA \t11/2024-Present\nWeb Developer\nAdvance skills in Python, React, Next.js, and AI/LLM integration by building cutting-edge applications for hobbyist and experimental purposes, delivering responsive and aesthetically pleasing interfaces for AI-powered applications.\nSelect Achievements\nDesigned and implemented authentication features, enabling secure user login and data storage for personalized astrological insights.\nDeveloped Python application for astrological natal chart generation, integrating traditional and sidereal zodiac interpretations and utilizing AI for enhanced chart analysis.\nCreated Dream Loop, a single-page application powered by Google Gemini AI models and using Next.js and React, designed for dream analysis and pattern recognition. \nDelivered two iterations: one featuring Python backend for analytical processing and another optimized with modern web technologies to enhance interactivity and user experience.\nWrote a Python application to generate dynamic fortunes based on user inputs, featuring multiple perspective options.\nDesigned and developed Daily Glow, a cross-platform mood and gratitude journaling app using React Native (TypeScript, Expo) and Supabase, featuring AI-powered emotional insights, secure user authentication (including anonymous mode), voice and image entries, and a personalized onboarding and analytics experience to promote daily self-reflection and mental wellness.\nRedesigned and modernized the website for Wood Products Unlimited, transforming a legacy static site into a responsive, SEO-optimized, and mobile-friendly experience with improved performance, accessibility, and user engagement using modern web technologies.\nMarineMax | Danvers, MA \t05/2024-11/2024\nMarine Technician\nTook short-term opportunity working in hobby-related field diagnosing and resolving complex mechanical, electrical, and hydraulic issues, achieving 20% decrease in unscheduled repair needs.\nConducted routine inspections and maintenance of marine engines and onboard systems, ensuring peak performance and reducing downtime for clients.\nDelivered rapid, effective solutions during high-pressure emergency repairs, restoring functionality and maintaining client trust under tight deadlines.\n\nPlanned Career Break | Revere, MA \t03/2023-05/2024\nContinuing Education\nTransitioned from longstanding career to pursue new opportunities in marine technology, culminating in education and certification at Bunker Hill Community College through completion of Marine Technician Program.\nConcurrently continued work in technical field by creating and managing blog applications focused on Disney and related topics, leveraging engaging content to drive traffic and explore passive income opportunities, including ad monetization.\nProduced and curated content for YouTube channel, delivering engaging videos on unique and interesting facts to attract viewers and build community.\nExplored monetization strategies for digital content platforms, gaining hands-on experience with Google's advertising systems and understanding viewership thresholds.\n\nAmerica’s Test Kitchen | Boston, MA \t01/2016-03/2023\nTechnical Lead Manager\nBolstered company’s technical capabilities by creating scalable and efficient architecture, leveraging Agile methodologies to streamline development, communication, and project management.\nSaved ATK millions of dollars throughout tenure by implementing cost-effective strategies, enhancing software infrastructure, and ensuring optimal resource utilization.\nMentored 15 junior engineers, fostering professional growth through structured coaching and guidance while promoting culture of technical excellence and innovation.\nLed cross-functional collaboration for new launches, aligning efforts across development, design, content, and marketing teams to achieve measurable growth.\nSelect Achievements \nDelivered major proprietary project on deadline for first time in company history, taking it to market within three months and setting new standard for efficiency and execution.\nTransformed online presence by transitioning to permanent website, resulting in increased traffic and audience engagement supported by robust marketing initiatives.\nOptimized backend architecture, improving scalability and efficiency through Heroku services, DNS management, and firewall configurations to enhance performance and reliability.\n\nAmerica’s Test Kitchen | Boston, MA \t01/2011-01/2016\nLead Software Engineer\nLed team of seven engineers in executing critical third-party integrations, including Google Ad tags, Salesforce, and CRM integrations, to improve system performance and user experience.\nCollaborated with cross-functional teams to build self-service platform for sponsorship team, allowing them to create and manage sweepstakes landing pages independently.\nSelect Achievements \nEnhanced lead conversion rates 20% and improved customer retention 15% by designing and implementing custom data migration solutions with marketing team, resulting in more streamlined customer journey.\nContributed to $10M in savings and increased operational efficiency 25% by overseeing high-impact migration project, transferring user data to new vendor and seamlessly integrating it into proprietary apps.\nIncreased site traffic 40% and boosted user engagement within first quarter by orchestrating development and successful launch of Cooks Country website, utilizing PHP and .NET backend APIs.\nReduced system downtime 30% and decreased dependency on development team 50% by implementing continuous improvements in infrastructure and processes.\n\nAmerica’s Test Kitchen | Boston, MA \t01/2010-01/2011\nDeveloper II\nCollaborated with cross-functional teams, including design and business partners, to create user-friendly, efficient platform; ensured full buy-in and approval from all stakeholders throughout project lifecycle.\nSelect Achievements \nDrove complete redesign and development of Cooks Illustrated platform, rewriting entire site from legacy .NET ASP to PHP; utilized Waterfall approach to ensure seamless transition and alignment with business goals.\nSpearheaded migration of legacy ASP websites to PHP, executing comprehensive solution that included data transfer and migration to AWS EC2 servers that optimized system performance, scalability, and cost-efficiency.\n\nReed Business Information | Waltham, WA \t01/2007-04/2010\nWeb Developer\nLed coding efforts as sole East Coast team member, collaborating with West Coast-based team to develop new module components for large-scale PHP website serving 200+ trade magazines.\nPlayed key role in migrating 96 online trade magazine websites from ASP to PHP, leveraging technical expertise to package and prepare websites for sale while ensuring code and database segregation for seamless transactions.\n\nEDUCATION \nUniversity of Miami | Coral Gables, FL \t\nBachelor of Science, Communications & Public Relations\n\nBunker Hill Community College | Boston, MA \t\nMarine Technician Program\n\nTECHNICAL \nRuby on Rails, SQL, Postgres, Redis, Heroku, Sidekiq, MongoDB, JavaScript, jQuery, React, Next.js, HTML, CMS, Python, .NET, PHP, ASP, Google Ads, Salesforce, AI (Gemini, DeepSeek,OpenAI,Llama), Large Language Models (LLMs), AWS\n", "job_description": "About the job\r\nVestmark is seeking a Full Stack Engineer with expertise in Ruby on Rails and React to help us build and enhance our financial advisor portal. In this role, you will work closely with product managers, designers, and other engineers to develop robust, scalable, and high-performance applications. This role operates in a hybrid work model based out of One Kendall Square, Cambridge MA or Wakefield, MA.\r\n\r\nResponsibilities\r\n\r\nDevelop, maintain, and improve Vestmark’s financial advisor platform using Ruby on Rails on the backend and React on the frontend.\r\nBuild RESTful APIs to support web and mobile applications.\r\nImplement well-structured, reusable, and testable code following best practices.\r\nCollaborate with UX/UI designers to deliver a seamless and intuitive user experience.\r\nOptimize application performance and scalability.\r\nWrite unit and integration tests to ensure high code quality.\r\nParticipate in code reviews, pair programming, and team discussions.\r\nWork with DevOps to deploy and monitor applications in production.\r\n\r\nQualifications\r\n\r\n3+ years of experience with Ruby on Rails development.\r\n2+ years of experience with React and modern JavaScript (ES6+).\r\nExperience with PostgreSQL or other relational databases.\r\nProficiency in writing scalable, secure, and maintainable code.\r\nExperience with TypeScript and Inertia.js is a plus.\r\nStrong grasp of object-oriented and functional programming concepts.\r\nExperience with testing frameworks like RSpec, Jest, or similar.\r\nFamiliarity with containerization (Docker) and cloud environments (AWS, Azure, or GCP) is a plus.\r\nExperience with authentication and authorization systems (Okta, Devise, or similar) is a plus.\r\n\r\nVestmark is an equal opportunity employer. We celebrate diversity and are committed to creating an inclusive environment for all employees. Vestmark prohibits employment discrimination on the basis of race, color, religion, gender identity, sex, sexual orientation, pregnancy, national origin, age, disability status, protected military or veteran status, and genetic information.", "original_filename": "Christopher_Candelora_Resume.docx", "optimized_resume": "Led team of seven engineers in executing critical third-party integrations, including Google Ad tags, Salesforce, and CRM integrations, to improve system performance and user experience.\nCollaborated with cross-functional teams to build self-service platform for sponsorship team, allowing them to create and manage sweepstakes landing pages independently.\nSelect Achievements \nEnhanced lead conversion rates 20% and improved customer retention 15% by designing and implementing custom data migration solutions with marketing team, resulting in more streamlined customer journey.\nContributed to $10M in savings and increased operational efficiency 25% by overseeing high-impact migration project, transferring user data to new vendor and seamlessly integrating it into proprietary apps.\nIncreased site traffic 40% and boosted user engagement within first quarter by orchestrating development and successful launch of Cooks Country website, utilizing PHP and .NET backend APIs.\nReduced system downtime 30% and decreased dependency on development team 50% by implementing continuous improvements in infrastructure and processes.\n\nAmerica’s Test Kitchen | Boston, MA \t01/2010-01/2011\nDeveloper II\nCollaborated with cross-functional teams, including design and business partners, to create user-friendly, efficient platform; ensured full buy-in and approval from all stakeholders throughout project lifecycle.\nSelect Achievements \nDrove complete redesign and development of Cooks Illustrated platform, rewriting entire site from legacy .NET ASP to PHP; utilized Waterfall approach to ensure seamless transition and alignment with business goals.\nSpearheaded migration of legacy ASP websites to PHP, executing comprehensive solution that included data transfer and migration to AWS EC2 servers that optimized system performance, scalability, and cost-efficiency.\n\nReed Business Information | Waltham, WA \t01/2007-04/2010\nWeb Developer\nLed coding efforts as sole East Coast team member, collaborating with West Coast-based team to develop new module components for large-scale PHP website serving 200+ trade magazines.\n\nTECHNICAL \n• Vestmark\n• Plus\n• Advisor\n• Designers\n• Financial\n• Similar\n• Status\n• Years\n• Authorization\n• Azure\nRuby on Rails, SQL, Postgres, Redis, Heroku, Sidekiq, MongoDB, JavaScript, jQuery, React, Next.js, HTML, CMS, Python, .NET, PHP, ASP, Google Ads, Salesforce, AI (Gemini, DeepSeek,OpenAI,Llama), Large Language Models (LLMs), AWS\n\n\nEDUCATION \nUniversity of Miami | Coral Gables, FL \t\nBachelor of Science, Communications & Public Relations\n\nBunker Hill Community College | Boston, MA \t\nMarine Technician Program\n\n"}